# Удаление первого и последнего вхождения.
# a_str = 'I am learning Python. hello, WORLD!'
# r_str = a_str[:a_str.find('h')]
# f_str = a_str[1 + a_str.rfind('h'):]
# print(r_str)
# print(f_str)
#
# df = r_str + f_str
# print(df)
import re

# Разворот последовательности символов между первым и последним вхождением символа "h" в противоположном порядке.
# ztr = 'I am learning Python. hello, WORLD!'
# r_str = ztr[:ztr.find('h') + 1]
# f_str = ztr[1 + ztr.find('h'):]
# jraf = f_str[:f_str.find('h')]
# tre = ''.join(reversed(jraf))
# ar = tre.lstrip()
# fraj = f_str[f_str.find('h'):]
# concatin = ar + fraj
# ra = ' ' + concatin
# con_concatin = r_str + ra
# print(r_str)
# print(ar)
# print(fraj)
# print(concatin)
# print(ra)
# print(con_concatin)


# Замена подстроки.

# n = input("Строка: ")
#
# print(n)
# i = input("Заменяемая подстрока: ")
# print(i)
# je = input('Новая подстрока: ')
# drf = n.replace(i, je)
# print('Конечный результат: ',  drf)


# Найти колличество слов, начинающихся с буквы "е".
#
# a_str = 'Ежевику для ежат  еле-еле принесли два ежа'
# lk = a_str.split(" ")
# i_str = 'е'
# l = ''
#
# for k in lk:
#     if k.startswith(i_str):
#         o = l.join(k)
#         print(o)



